<?php

$tmp=$QUERY_STRING;if($tmp=='') $tmp=$_SERVER["QUERY_STRING"];	// в зависимости от настроек сервера
$tmp=urldecode($tmp);
parse_str($tmp);									// теперь появятся переменные $url, $p и т.д.

if (!$id) $stmp="<p>1. <a href=\"f_story.php?id=about&amp;pi=$pi\">Введение</a>
<br/><b>Игровые вопросы</b>
<br/>1. <a href=\"f_faq.php?id=about\">Об игре</a>
<br/>2. <a href=\"f_faq.php?id=reg\">Как начать играть</a>
<br/>3. <a href=\"f_faq.php?id=map\">Карты</a>
<br/>4. <a href=\"f_faq.php?id=save\">Сохранение</a>
<br/><b>Настройки</b>
<br/>1. <a href=\"f_faq.php?id=err\">При частых ошибках</a>
<br/>2. <a href=\"f_faq.php?id=lagi\">Если игра днем тормозит</a>
<br/><b>Ошибки</b>
<br/>1. <a href=\"f_faq.php?id=problem\">Если проблемы с персонажем</a>
<br/>2. <a href=\"f_faq.php?id=nlogin\">Не могу войти в игру</a>
<br/>3. <a href=\"f_faq.php?id=nloc\">Завис в локации</a>
<br/>4. <a href=\"f_faq.php?id=load\">Оказался в другом месте, пропали вещи или навыки</a>
<br/>5. <a href=\"f_faq.php?id=npc\">В локации пропал NPC</a>
<br/>6. <a href=\"f_faq.php?id=probel\">Не работают контакты или в чате не выводятся пробелы</a>
<br/>7. <a href=\"f_faq.php?id=dialog\">Ошибки в диалогах</a>
<br/>8. <a href=\"f_faq.php?id=loc\">Постоянная ошибка в одной и той же локации</a>
<br/>9. <a href=\"f_faq.php?id=inv\">Не открывается меню \"Персонаж\" или банк</a>
<br/>10. <a href=\"f_faq.php?id=mail\">Как сообщить об ошибке или задать вопрос</a>
<br/><b>Другое</b>
<br/>1. <a href=\"f_faq.php?id=dgprs\">Дешевый GRPS</a>
<br/>2. <a href=\"f_faq.php?id=ch\">Как уменьшить траффик</a>
<br/>3. <a href=\"f_faq.php?id=dgprs\">Список IP-гейтов</a>
<br/>4. <a href=\"f_faq.php?id=admin\">Кто разработчик игры, авторские права</a>
";

if ($id=="about") $stmp="<p>Территория Зла - это многопользовательская текстовая игра жанра RPG, в которую можно играть с мобильного телефона через WAP.
<br/>Вы можете выполнять квесты, использовать предметы и магию, развивать свои навыки, создавать и вступать в кланы, захватывать и оборонять замки, приручать животных, нанимать союзников и командовать ими и многое, многое  другое. При этом одновременно с вами могут играть сотни других игроков!
<br/>В игре около 1000 локаций, 38 заклинаний, около 500 предметов - оружие, броня, элексиры, еда и т.д., примерно 100 NPC с нелинейными диалогами, 30 навыков, которые можно развивать, включая такие как \"приручение животных\", \"воровство\", \"кузнец\", \"плотник\" и т.д., встроенный чат и аналог ICQ.";

if ($id=="reg") $stmp="<p>Если вы первый раз на этом сайте, то введите свое имя английскими буквами (до 10 символов) и любой пароль (не используйте в качестве пароля свое имя, цифры 111, 12345 и другие варианты, которые легко подобрать), после чего нажмите ссылку \"Регистрация\".
<br/>После регистрации входите в игру и поговорите с Привратником Уином, он расскажет вам об управлении и игровом мире, а также подскажет, с чего лучше начать.";

if ($id=="map") $stmp="<p>Включите в настройках карту, либо скачивайте с компьютера более крупные по ссылкам:
<br/>1. Карта мира, каждая точка - отдельная локация: http://zlo.holys.com.ru/game/map_world.png (4.5 кб)
<br/>2. Рисованная карта (город внизу): http://zlo.holys.com.ru/game/map_main.jpg (56 кб)
<br/>3. Карта со всеми локациями: http://zlo.holys.com.ru/game/map_all.jpg (70 кб)
<br/>4. Крупная карта города (начальная позиция в центре и немного справа): http://zlo.holys.com.ru/game/map_city.jpg (91 кб)
<br/>5. Подробная карта города: http://zlo.holys.com.ru/game/map_city2.jpg (151 кб)
<br/>6. Карта Ансалона (новая территория за горами на востоке): http://zlo.holys.com.ru/game/map_ansalon.jpg (33 кб)
<br/>7. Карта города с описаниями. Очень пригодится новичкам, там описано где и какой квест можно получить у горожан, где дешевле продать и выгоднее купить: http://zlo.holys.com.ru/game/map_city3.jpg (440 кб)";

if ($id=="save") $stmp="<p>Так как иногда могут происходить ошибки записи на диск, база данных может быть недоступна и возникать другие непредвиденные проблемы, то рекомендуем вам регулярно сохранять своего персонажа, выбирая из меню пункт \"Сохранить\". Делайте это когда получаете очередное очко опыта, раздобыли крутое оружие или броню. Если что-то случится, персонаж будет восстановлен с последнего сохранения.
<br/>Используйте также этот пункт для выхода из игры, чтобы узнать, успешно ли был сохранен персонаж.";

if ($id=="npc") $stmp="<p>Возможно, это произошло в результате ошибки записи локации на диск. Сообщите где это произошло (в каком магазине, а если знаете имя торговца, то еще лучше) и на каком сервере.";


if ($id=="err") $stmp="<p>В большинстве случаев ошибки при загрузке происходят из-за того, что размер WAP страницы больше, чем может понимать телефон или IP гейт. Особенно это касается старых моделей. Попробуйте в настройках уменьшить размер списков до 4, а размер страницы до 1200, включите сокращенное меню (или даже на отдельной странице), отключите описание локаций и информацию о пришедших игроках, поставьте число пунктов в исп. магию, прием и предмет 0, а также удалите все макросы. Если не помогает, то включите звуки рядом с выходами и, в крайнем случае, отключите журнал. Для уменьшения размера страницы и траффика попробуйте также  изменить кодировку. <a href=\"f_faq.php?id=ch\">Читать дальше</a>";

if ($id=="ch") $stmp="<p>Обычно в WAP русские буквы заменяются на интернациональные сочетания символов, например, \"&#x041f;\" - это буква \"П\", т.е. каждый русский символ занимает целых восемь байт (или как минимум 2 байта после декодирования на ip-гейте оператора). Но современные телефоны способны понимать и обычные русские буквы, которые в WML коде занимают по одному байту. Насколько мне известно, московские операторы пропускают только кодировку koi8r, а наиболее распространенную windows-1251 нет, так что просто пробуйте оба варианта. Если телефон выдаст ошибку или абракадабру, войдите в игру заново и поменяйте кодировку на другую. Реально замена utf-8 на windows-1251 или koi8r уменьшает траффик в полтора-два раза, особенно это заметно если ваш телефон может загружать страницы по <a href=\"f_faq.php?id=dgprs\">интернет тарификации</a> без ip-гейта.";

if ($id=="lagi") $stmp="<p>Попробуйте зайти в игру ночью или ранним утром (до 7 утра). Если скорость открытия страниц заметно выше, то скорей всего дело в качестве вашего GPRS (днем и вечером он обычно работает медленнее, чем ночью и утром) и загруженности вашей соты сети. В таком случае измените <a href=\"f_faq.php?id=err\">настройки игры</a>, чтобы уменьшить размер скачиваемых страниц, что немного повысит скорость или попробуйте <a href=\"f_faq.php?id=ugprs\">сменить IP гейт</a>.
<br/>Причина задержек в игре также может быть из-за нагрузки сервера - днем больше, ночью меньше. Пик нагрузки обычно вечером в 22:00-23:00 часа.";

if ($id=="problem") $stmp="<p>Зайдите в почту(можно зарегить на http://wapmail.gala.net), выберите ссылку \"Почта\" и отправьте на адрес admin@worldwap.info письмо, где укажите модель своего телефона, на каком сервере и во сколько играли, что делали в игре перед возникновением ошибки. Подробно опишите проблему и что надо восстановить/сделать, а также укажите свой логин (пароль не надо, никогда и никому не сообщайте свой пароль, даже если его у вас попросят от имени Админа!). Я зайду в игру вашим персонажем и на месте разберусь в чем дело. При этом выходить из игры совсем не обязательно, но желательно находиться на охраняемой территории, чтобы вас случайно не убили другие игроки или монстры.";

if ($id=="nlogin") $stmp="<p>Если при входе в игру вам показывается экран \"Добро пожаловать!\", а дальше всегда происходит ошибка, то скорей всего вы стоите в локации со слишком длинным описанием и ваш телефон не может загрузить такую большую WAP страницу. Прежде всего, зайдите в настройки и установите минимальные. Если не помогает, то либо зайдите с другого телефона, либо смотрите раздел \"Если проблемы с персонажем\". Можете также сообщить модель телефона и где застряли, чтобы исправить это в след. обновлениях игры.";

if ($id=="nloc") $stmp="<p>Если при переходе в следующую локацию телефон не может загрузить ее и постоянно выдает какую-нибудь ошибку, попробуйте два раза (именно два раза!) вернуться назад (нажать в своем телефоне кнопку, загружающую предыдущую страницу, обычно это кнопка завершения разговора). Если повезет, то вернетесь на предыдущую локацию.";

if ($id=="load") $stmp="<p>Скорей всего, произошла какая-то ошибка и ваш персонаж был загружен с последнего сохранения, так что регулярно <a href=\"f_faq.php?id=save\">сохраняйтесь</a>.
<br/>Другая возможная причина - кто-то узнал ваш пароль (например, если вы используете в качестве пароля свой логин или простенькую комбинацию вроде 123, abc, aaa И т.д.), зашел в игру от вашего имени на наделал всяких гадостей (любителей хватает, можете поверить).
<br/>Учтите, что одним персонажем могут одновременно управлять несколько человек, так что даже если вы в игре, тот кто знает ваш пароль может в это же время выбросить ваши вещи или напасть вашим персонажем в охраняемой зоне. Если вы заметили, что вашим персонажем управляет кто-то другой, немедленно смените пароль для входа в игру. Исключение - работа <a href=\"f_faq.php?id=admin\">админа</a> по совершенствованию игры.";

if ($id=="probel") $stmp="<p>Используйте вместо пробела точку \".\" или символ плюс \"+\". Зависит от телефона.";

if ($id=="dialog") $stmp="<p>Сообщите имя NPC и о чем шла речь.";

if ($id=="loc") $stmp="<p>Сообщите где это случилось и при каких обстоятельствах. Скорее всего, в этой локации (или соседних) есть предмет или монстр с недопустимыми параметрами и игра выводит клиенту код ошибки, чтобы не допустить критического изменения в файлах. Если ваш телефон способен отобразить хоть какой-то текст в такой ситуации (обычно это делают последние модели телефонов, остальные просто сообщают об общей ошибке), пришлите нам этот текст.";

if ($id=="inv") $stmp="<p>Скорей всего у вас в инвентори или банке есть неправильный предмет. Сообщите на admin@worldwap.info какой предмет вы получили последним и откуда (подняли с трупа монстра или игрока, купили в магазине, получили за выполнение квеста и т.д.).
<br/>После чего просто войдите в игру заново. Скорей всего, неправильный предмет будет автоматически удален и вы сможете продолжить игру.";


if ($id=="mail") $stmp="<p>Если вам что-то непонятно, лучше задать вопрос в форуме другим игрокам. А если хотите сообщить о критической ошибке (проблемы с персонажем, недоступность локаций или диалогов, неправильное функционирование предметов или магии и т.д.), то лучше по почте: отправьте почту на admin@worldwap.info, где опишите суть проблемы.
<br/>Не забудьте для начала ознакомиться с другими разделами этой страницы, т.к. если много писем, то отвечать на вопросы, которые описаны здесь, у администрации просто нет возможности. <br/>Пожалуйста, не шлите одинаковые письма чаще одного раза в день. Если не получили ответа, значит на то были причины (например, слишком много писем). Бессмысленным захламлением почтового ящика вы только уменьшаете шансы на ответ и оказание помощи!";

if ($id=="ugprs") $stmp="<p>Внимание! На APN internet.beeline.ru и internet.mts.ru порты 9201 и 9203 заблокированы, поэтому могут работают (да и то не факт) только IP с нестандартными портами (1201, 8000 и т.д.). Самый последний обновляемый список смотрите на <a href=\"http://ostrovok.kmx.ru/ipyz.wml\">ostrovok.kmx.ru/ipyz.wml</a> или на <a href=\"http://wap.mag.su/magistr/index.php?url=http://ail.ints.ru/wapgateway.html\">http://ail.ints.ru/wapgateway.html</a> (через Magistr).
<br/>Список IP гейтов (в скобках указан порт):
<br/>194.67.106.186 (7201)
<br/>195.131.114.178 (8000,8001)
<br/>207.232.99.109 (1201)
<br/>212.58.203.26 (8002-8005)
<br/>194.135.37.249 (7201,8000)
<br/>Со стандартным портом 9201:
<br/>194.048.124.071
<br/>192.036.140.080
<br/>148.122.161.115
<br/>194.129.183.045
<br/>195.098.032.115
<br/>212.185.045.150
<br/>160.092.122.122
<br/>192.168.017.012
<br/>193.113.200.195
<br/>192.168.192.168
<br/>193.113.200.231
<br/>194.204.012.042";

if ($id=="dgprsip2") $stmp="<p>Телефон не скачивает WAP страницы напрямую, а делает это через специальный гейт. Поэтому иногда смена IP гейта в настройках WAP может значительно ускорить открытие страниц. Если же сам по себе GPRS работает медленно, то это не поможет. Некоторые операторы не позволяют менять гейт или позволяют только с нестандартными портами. Также многие гейты могут просто не работать, пробуйте. Иногда помогает смена порта с 9201 на 9203 (а если нет возм. менять порт, то вкл. защиту, если есть).<br/><a href=\"f_faq.php?id=ugprs\">Список IP-гейтов</a>";

if ($id=="dgprs") $stmp="<p>Идея состоит в том, чтобы для просмотра WAP страниц использовать настройки GPRS-интернет (по цене примерно 20 центов за 1 мегабайт траффика), а не предлагаемые операторами по умолчанию GPRS-WAP настройки (до 3 долларов за 1 мегабайт!!!). Сделать это можно несколькими способами, но проблема в том, что операторы предпринимают все мыслимые меры (блокируют порты, запрещают доступ к другим IP и т.д.), чтобы не допустить этого по понятным причинам материального характера ;-) <a href=\"f_faq.php?id=dgprs2\">Читать дальше</a>";


if ($id=="dgprs2") $stmp="<p>Итак, самый простой способ - просто изменить в настройках телефона APN wap.beeline.ru на internet.beeline.ru (или wap.mts.ru на internet.mts.ru для абонентов МТС, с остальными операторами аналогично). Это работает на современных моделях телефонов, например, на Siemens CX65, M65 и S65 (начиная с <a href=\"f_faq.php?id=x65\">43 прошивки и выше</a>). Но для большинства телефонов этого недостаточно... <a href=\"f_faq.php?id=dgprs3\">Читать дальше</a>";


if ($id=="dgprs3") $stmp="<p>Для большинства телефонов необходимо также заменить стандартный IP адрес на <a href=\"f_faq.php?id=dgprsip\">альтернативный</a>. Второй способ - использовать HTTP прокси, если телефон поддерживает такую возможность (все Siemens'ы 65 серии). Для этого в настройках указываете что-то вроде \"Использовать протокол HTTP\" и вместо стандартного IP гейта пишите любой WWW прокси, например 193.170.43.114, порт 8080. Адреса других HTTP прокси можно узнать на <a href=\"http://wap.mag.su/magistr/index.php?url=http://ail.ints.ru/wapgateway.html\">http://ail.ints.ru/wapgateway.html</a> или <a href=\"http://wap.mag.su/magistr/index.php?url=http://www.void.ru\">www.void.ru</a> (оба сайта через Magistr).

<a href=\"f_faq.php?id=dgprs4\">Читать дальше</a>
";

if ($id=="dgprs4") $stmp="<p>Ну и последний вариант - использовать WAP браузеры, написанные на JAVA. Все они работают по тарификации GPRS-интернет. Специально для игры Территории Зла написан небольшой (13 кб) <a href=\"http://zlo.holys.com.ru/game/java.php\">WapBrouser</a>. Также попробуйте появившийся недавно <a href=\"http://www.kycb-kycb.narod.ru/CoolBrowser04ru.jad\">CoolBrowser 0.4</a> (www.kycb-kycb.narod.ru/CoolBrowser04ru.jar, 80 кб), думаю, новые версии будут по этому же адресу, заменяйте 04 на 05 т.д. Это все что мне известно на данный момент, если хотите что-то добавить, пишите на admin@worldwap.info
<br/>Читайте также как <a href=\"f_faq.php?id=ch\">уменьшить траффик</a>.";

if ($id=="dgprs5") $stmp="<p>Прокси";


if ($id=="dgprsip") $stmp="<p>Если у вашего оператора есть тариф gprs-internet и он дешевле, чем gprs-wap, то можно использовать его, для этого нужно в настройках WAP указать APN internet.mts.ru (или internet.beeline.ru, если вы абонент Beeline) и IP из <a href=\"f_faq.php?id=ugprs\">этого списка</a>. Если один IP не работает, пробуйте другой.
<br/>Учтите, что обычно в тарифных планах gprs-internet тарификация идет минимум за 40-60 кб, т.е. поиграв на 20 кб, с вас снимут денег как за 40 кб, поэтому для просмотра раз в день погоды через WAP выгодней gprs-wap, а для игр через wap, если за один заход скачиваете более 50 кб (т.е. открываете несколько десятков wap страниц), то gprs-internet.<br/><a href=\"f_faq.php?id=dgprsip2\">Подробней</a>";

if ($id=="admin") $stmp="<p>Любые вопросы, связанные с игрой по почте admin@worldwap.info.";



if ($id=="x65") $stmp="<p>Владельцы телефонов Siemens CX65, M65 и S65 начиная с 43 прошивки (узнать текущую можно набрав *#06#, а далее SW-Version) могут смотреть WAP и некоторые WWW страницы напрямую, минуя IP гейт оператора, для этого в Меню/Настройки/Перед.дан. в профиле GPRS установите APN: internet.beeline.ru, а в вапбраузере в настройке профиля поставьте протокол HTTP, полностью удалите IP адрес (или введите 0.0.0.0) и поставьте порт 80. Если телефон напишет Неправильный адрес URL, то удалите пробелы в конце поля Стартовая страницы. 43 прошивку (11 Мб) можно скачать на www.forum.siemens-club.ru в разделе Siemens x65, Обсуждение прошивок, для установки потребуется также USB или COM кабель для подключения к компьютеру, см. там же на форуме. 
<br/><a href=\"f_faq.php?id=x652\">Далее...</a>
";

if ($id=="x652") $stmp="<p>ПЛЮСЫ 43 прошивки:
<br/>- WAP по интернет тарифам 20 центов за 1 мегабайт, а не 3 доллара, как в обычном WAP!!!
<br/>- Работает обычно быстрее, чем через гейт, т.к. гейт в билайне вечно перегружен
<br/>- Никогда не появляется MORE, ошибка 502 и прочая билайновская гадость
<br/>- Нет предела на размер WAP страницы
<br/>- Можно открывать любые английские WWW сайты и русские в кодировке Koi8-R, хотя windows-1251 сименсы не поддерживают :-((
<br/>- В 43 прошивке немного другой браузер, есть автоподстановка введенного ранее текста, возможность копировать текст и т.д.
<br/>- Чтобы вводить русский текст в WAP, установите Русский язык в Меню/Настройки/Индикация/Ввод текста/Язык ввода
<br/><a href=\"f_faq.php?id=x653\">Далее...</a>
";

if ($id=="x653") $stmp="<p>МИНУСЫ:
<br/>- Браузер стал переносить текст не по словам, а по буквам(!!!), но к этому несложно привыкнуть, к тому же на экран стало влезать больше текста
<br/>- Средний размер WAP страницы через HTTP профиль 3кб, а через WSP 1кб, но в итоге все равно получается намного дешевле
<br/>- Размер видео на 43 прошивке не ставится более 30 сек (на 16 прошивке точно работало 1 минуту)
<br/>- Одна сессия тарифицируется минимум за 50кб, т.е. желательно сразу открывать не менее 15 WAP страниц, чтобы не терять напрасно деньги за траффик
";

$stmp.="<br/><br/><anchor>[Назад]<prev/></anchor>";

if ($pi) {
	require($GLOBALS["DOCUMENT_ROOT"]."/javainc.ssp");
	$stmp.="</p><p align=\"center\"><br/><small><a href=\"$homeurl\">$home </a> 2004<br/></small>\n";
	}

msg($stmp);

function msg($s) {
	header("Content-type:text/vnd.wap.wml;charset=utf-8"); 

	setlocale (LC_CTYPE, 'ru_RU.CP1251'); 
	function win2unicode ( $s ) { if ( (ord($s)>=192) & (ord($s)<=255) ) $hexvalue=dechex(ord($s)+848); if ($s=="Ё") $hexvalue="401"; if ($s=="ё") $hexvalue="451"; return("&#x0".$hexvalue.";");} 
	function translate($s) {return(preg_replace("/[А-яЁё]/e","win2unicode('\\0')",$s));} 

	ob_start("translate");
	echo "<?xml version=\"1.0\"?>\n<!DOCTYPE wml PUBLIC \"-//WAPFORUM//DTD WML 1.1//EN\" \"http://www.wapforum.org/DTD/wml_1.1.xml\">";
	echo "
<wml>
<card title=\"Помощь\">";
echo "
$s
</p>
</card>
</wml>";
	ob_end_flush();
	die("");
	}
